---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateRoomSeparation
source: html/9f432f9a-0f4c-1d35-3ca0-fd316b3d3516.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateRoomSeparation Property

Room separation line is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateRoomSeparation { get; }
```